Revit 2027 API
FabricSheet.Create(Document, Element, ElementId) Method
 Creates a new instance of a single flat Fabric Sheet element within the project.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FabricSheet Create(
	Document document,
	Element hostElement,
	ElementId fabricSheetTypeId
)
Public Shared Function Create (
	document As Document,
	hostElement As Element,
	fabricSheetTypeId As ElementId
) As FabricSheet
public:
static FabricSheet^ Create(
	Document^ document,
	Element^ hostElement,
	ElementId^ fabricSheetTypeId
)
static member Create :
        document : Document *
        hostElement : Element *
        fabricSheetTypeId : ElementId -> FabricSheet
Parameters
document Document
 The document in which the fabric sheet is to be created.
hostElement Element
 The element that will host the FabricSheet. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
fabricSheetTypeId ElementId
 The id of the FabricSheetType.
Return Value
FabricSheet
 The newly created single Fabric Sheet instance.
Exceptions
Exception | Condition
ArgumentException |  The element hostElement was not found in the given document. -or- The host Element is not a valid host for Fabric Sheet. -or- fabricSheetTypeId should refer to an FabricSheetType element.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricSheet Class
Create Overload
Autodesk.Revit.DB.Structure Namespace